cfg/InformationRegisters/ПоложенныеЕжегодныеОтпускаРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПоложенныеЕжегодныеОтпускаРаботников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Положено</Name>
					<Comment>Положенное количество дней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗОТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/InformationRegisters/ПоложенныеЕжегодныеОтпускаРаботников/Forms/ФормаЗаполнения/Ext/Form/Module.bsl
Процедура ОсновныеДействияФормыВыполнить(Кнопка)
	
	Запрос = Новый Запрос();
	Если ЗначениеЗаполнено(Организация) Тогда
		ФильтрОрганизация = "И РаботникиОрганизаций.Организация = &Организация";
	Иначе
		ФильтрОрганизация = "";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПериодС) И НЕ ЗначениеЗаполнено(ПериодПо) Тогда
		ФильтрПериод = "";
	ИначеЕсли ЗначениеЗаполнено(ПериодС) И НЕ ЗначениеЗаполнено(ПериодПо) Тогда
		ФильтрПериод = "И РаботникиОрганизаций.Период >= &ПериодС";
	ИначеЕсли НЕ ЗначениеЗаполнено(ПериодС) И ЗначениеЗаполнено(ПериодПо) Тогда
		ФильтрПериод = "И РаботникиОрганизаций.Период <= &ПериодПО";
	Иначе
		ФильтрПериод = "И РаботникиОрганизаций.Период >= &ПериодС И РаботникиОрганизаций.Период <= &ПериодПО";
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодС", ПериодС);
	Запрос.УстановитьПараметр("ПериодПО", ПериодПО);
	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	РаботникиОрганизаций.Период,
	   |	РаботникиОрганизаций.Организация,
	   |	РаботникиОрганизаций.Сотрудник
	   |ИЗ
	   |	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.ПоложенныеЕжегодныеОтпускаРаботников КАК ПоложенныеЕжегодныеОтпускаРаботников
	   |    ПО РаботникиОрганизаций.Организация = ПоложенныеЕжегодныеОтпускаРаботников.Организация
	   |     И РаботникиОрганизаций.Сотрудник = ПоложенныеЕжегодныеОтпускаРаботников.Сотрудник
	   |
	   |ГДЕ
	   |    РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	   |    И ПоложенныеЕжегодныеОтпускаРаботников.Сотрудник ЕСТЬ NULL
	   |    "+ФильтрОрганизация+"
	   |    "+ФильтрПериод+"
	   |";
	   
	 Выборка = Запрос.Выполнить().Выбрать();
	 НаборЗаписей = РегистрыСведений.ПоложенныеЕжегодныеОтпускаРаботников.СоздатьНаборЗаписей();
	 НаборЗаписей.Прочитать();
	 Пока Выборка.Следующий() Цикл
		Для Каждого Отпуск из Отпуска Цикл
			
			Если Отпуск.Дней = 0 Тогда
				Продолжить;
			КонецЕсли;	
			Запись = НаборЗаписей.Добавить();
			
			//Свойства
			Запись.Период 						= Выборка.Период;
			
			//Измерения
			Запись.Сотрудник					= Выборка.Сотрудник;
			Запись.Организация					= Выборка.Организация;
			Запись.ВидОтпуска					= Отпуск.ВидОтпуска;
			
			//Реквизиты
			Запись.Положено						= Отпуск.Дней;		
			
		КонецЦикла;	
	 КонецЦикла; 
	 
	 НаборЗаписей.Записать(Истина);
	 Закрыть();
	 
КонецПроцедуры

Процедура ПриОткрытии()
	
	Отпуск = Отпуска.Добавить();
	Отпуск.ВидОтпуска = Справочники.ВидыОтпусков.ЕжегодныйОсновной;
	Отпуск.Дней = ПроцедурыУправленияПерсоналом.ПолучитьПоложенноеКоличествоДнейОтпуска(Организация);
	Если Отпуск.Дней = 0 Тогда
		Отпуск.Дней = 24;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыОтпусков.Ссылка,
	               |	ВидыОтпусков.Код КАК Код
	               |ИЗ
	               |	Справочник.ВидыОтпусков КАК ВидыОтпусков
	               |ГДЕ
	               |	ВидыОтпусков.ВедетсяУчетОстатков
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
	   
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Если Выборка.Ссылка <> Справочники.ВидыОтпусков.ЕжегодныйОсновной Тогда
			Отпуск = Отпуска.Добавить();
			Отпуск.ВидОтпуска = Выборка.Ссылка;
		 КонецЕсли;	
	 КонецЦикла;
	
КонецПроцедуры
